Documents/РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РеестрПлатежей</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цессионарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлательщика</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПлательщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолговоеОбязательство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтадияДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежа</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ИсторияПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлательщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеразнесеннаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоСудебнымРешениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьРешения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженностиПоРешению</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоВнесудебке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Займ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеестрПлатежей/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеПлатежа.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                      |ГДЕ
	                      |	ПоступлениеПлатежа.Автор = &Автор
	                      |	И ПоступлениеПлатежа.Проведен = ИСТИНА
	                      |	И ПоступлениеПлатежа.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат;		
	КонецЕсли;
	
	//ОпределитьВариантУчетаЗадолженности(ЭтотОбъект.ЗагруженныеДанные);
	
	
	Для Каждого стр из ЭтотОбъект.ЗагруженныеДанные Цикл
		Если Не ЗначениеЗаполнено(стр.ДолговоеОбязательство) ИЛИ Не ЗначениеЗаполнено(стр.Дата) Или Не ЗначениеЗаполнено(стр.Сумма) Тогда
			Продолжить;
		КонецЕсли;
		ДокументПлатеж = Документы.ПоступлениеПлатежа.СоздатьДокумент();
		ДокументПлатеж.Дата = ТекущаяДата();
		ДокументПлатеж.Автор = ЭтотОбъект.Ссылка;
		ДокументПлатеж.Займ = стр.ДолговоеОбязательство;
		ДокументПлатеж.ИсполнительныйДокумент = стр.ИсполнительныйДокумент;
		ДокументПлатеж.ВидПлательщика = стр.ВидПлательщика;
		ДокументПлатеж.СуммаПлатежа = стр.Сумма;
		ДокументПлатеж.ДатаПлатежа = стр.Дата;
		ДокументПлатеж.НазначениеПлатежа = стр.НазначениеПлатежа;
		ДокументПлатеж.НеразнесеннаяСумма = стр.Сумма;
		ДокументПлатеж.Сотрудник = стр.Сотрудник;
		// ДокументПлатеж.стрПлательщик = стр.Плательщик;
		// ДокументПлатеж.ВидПоступления = Справочники.ВидыПоступленийПлатежа.БанковскаяВыписка;
		

		//Если стр.СтадияДО = "Судебная" Тогда 
		//	ДокументПлатеж.РаспределитьПоСудебнымРешениям();
		//ИначеЕсли стр.СтадияДО = "Внесудебная" Тогда
		//	ДокументПлатеж.РаспределитьПоВнесудебке();
		//КонецЕсли;
		
		
		// ДокументПлатеж.РаспределитьПоСудебнымРешениям();
		// ДокументПлатеж.РаспределитьПоВнесудебке();
		
		// Проводить документы в отдельной транзакции
		НачатьТранзакцию();
		//ДокументПлатеж.Записать(РежимЗаписиДокумента.Проведение);
		ДокументПлатеж.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
	КонецЦикла;
КонецПроцедуры

Процедура ОпределитьВариантУчетаЗадолженности(ТЧ);
	// Объявить переменную ЮД
	ЮД = Справочники.тсЗначенияСвойствОбъектов.НайтиПоНаименованию("Передано в ЮД");
	Для Каждого стр из ТЧ Цикл
		// Проверить на передачу в ЮД и определить стадию 
		Если ОбъектыСервер.ПолучитьЗначениеСвойства(стр.ДолговоеОбязательство, "0182") = ЮД Тогда
			стр.СтадияДО = "Судебная";
		Иначе
			стр.СтадияДО = "Внесудебная"	
		КонецЕсли;		
		// На данный момент этот реквизит не используется
		// стр.СтадияДО = Строка(ОбъектыСервер.ОпределитьВариантУчетаЗадолженности2(стр.ДолговоеОбязательство,стр.Дата));
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	|ГДЕ
	|	ПоступлениеПлатежа.Автор = &Автор
	|	И ПоступлениеПлатежа.Проведен = ИСТИНА
	|	И ПоступлениеПлатежа.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Ссылка);  
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Док = Результат.Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЦикла;   
	КонецЕсли;	
	
КонецПроцедуры
